#Задание №1
int_first_value = int(input('Введите первое целое число: '))
int_second_value = int(input('Введите второе целое число: '))
string_value = input('Введите строку: ')
float_value = float(input('Введите дробное число: '))


print('Строка: ' + string_value)
print('Первое число: ' + str(int_first_value) + ', ' 'Второе число: ' + str(int_second_value))
print('Дробное число: ' + str(float_value))
