#Задание №3
name = input('Введите имя: ')
surname = input('Введите фамилию: ')
patronymic_name = input('Введите отчество: ')
age = input('Введите возраст: ')
city = input('Введите город: ')

print('ФИО: ' + name + ' ' + surname + ' ' + patronymic_name)
print(age)
print(city)

